In [9]:
import pandas as pd
import numpy as np

In [2]:
s = pd.Series([0.1,0.2,0.3,0.4,0.5], index=['a','b','c','d','e'])
s

a    0.1
b    0.2
c    0.3
d    0.4
e    0.5
dtype: float64

In [3]:
s[s>0.2]

c    0.3
d    0.4
e    0.5
dtype: float64

In [4]:
s>0.2

a    False
b    False
c     True
d     True
e     True
dtype: bool

In [5]:
data = pd.DataFrame.from_csv('titanic.csv')

In [10]:
age = data['Age']
np.mean(age)  # Media de edades.

29.69911764705882

In [12]:
data.head(4)

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S

In [13]:
pd.crosstab(index=data['Survived'], columns=data['Sex'])

Sex       female  male
Survived
0             81   468
1            233   109

In [14]:
data.columns

Index(['Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp', 'Parch', 'Ticket',
       'Fare', 'Cabin', 'Embarked'],
      dtype='object')